valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxSent_bf.h
/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC7 */
#define IFX_SENT_INTOV_IPC7_OFF (7u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC8 */
#define IFX_SENT_INTOV_IPC8_OFF (8u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC9 */
#define IFX_SENT_INTOV_IPC9_OFF (9u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC10 */
#define IFX_SENT_INTOV_IPC10_OFF (10u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC11 */
#define IFX_SENT_INTOV_IPC11_OFF (11u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC12 */
#define IFX_SENT_INTOV_IPC12_OFF (12u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC13 */
#define IFX_SENT_INTOV_IPC13_OFF (13u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC14 */
#define IFX_SENT_INTOV_IPC14_OFF (14u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC15 */
#define IFX_SENT_INTOV_IPC15_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC15 */
#define IFX_SENT_INTOV_IPC15_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC15 */
#define IFX_SENT_INTOV_IPC15_OFF (15u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC16 */
#define IFX_SENT_INTOV_IPC16_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC16 */
#define IFX_SENT_INTOV_IPC16_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC16 */
#define IFX_SENT_INTOV_IPC16_OFF (16u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC17 */
#define IFX_SENT_INTOV_IPC17_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC17 */
#define IFX_SENT_INTOV_IPC17_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC17 */
#define IFX_SENT_INTOV_IPC17_OFF (17u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC18 */
#define IFX_SENT_INTOV_IPC18_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC18 */
#define IFX_SENT_INTOV_IPC18_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC18 */
#define IFX_SENT_INTOV_IPC18_OFF (18u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC19 */
#define IFX_SENT_INTOV_IPC19_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC19 */
#define IFX_SENT_INTOV_IPC19_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC19 */
#define IFX_SENT_INTOV_IPC19_OFF (19u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC20 */
#define IFX_SENT_INTOV_IPC20_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC20 */
#define IFX_SENT_INTOV_IPC20_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC20 */
#define IFX_SENT_INTOV_IPC20_OFF (20u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC21 */
#define IFX_SENT_INTOV_IPC21_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC21 */
#define IFX_SENT_INTOV_IPC21_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC21 */
#define IFX_SENT_INTOV_IPC21_OFF (21u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC22 */
#define IFX_SENT_INTOV_IPC22_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC22 */
#define IFX_SENT_INTOV_IPC22_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC22 */
#define IFX_SENT_INTOV_IPC22_OFF (22u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC23 */
#define IFX_SENT_INTOV_IPC23_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC23 */
#define IFX_SENT_INTOV_IPC23_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC23 */
#define IFX_SENT_INTOV_IPC23_OFF (23u)

/** \brief Length for Ifx_SENT_INTOV_Bits.IPC24 */
#define IFX_SENT_INTOV_IPC24_LEN (1u)

/** \brief Mask for Ifx_SENT_INTOV_Bits.IPC24 */
#define IFX_SENT_INTOV_IPC24_MSK (0x1u)

/** \brief Offset for Ifx_SENT_INTOV_Bits.IPC24 */
#define IFX_SENT_INTOV_IPC24_OFF (24u)

/** \brief Length for Ifx_SENT_TSR_Bits.CTS */
#define IFX_SENT_TSR_CTS_LEN (32u)

/** \brief Mask for Ifx_SENT_TSR_Bits.CTS */
#define IFX_SENT_TSR_CTS_MSK (0xffffffffu)

/** \brief Offset for Ifx_SENT_TSR_Bits.CTS */
#define IFX_SENT_TSR_CTS_OFF (0u)

/** \brief Length for Ifx_SENT_TPD_Bits.TDIV */
#define IFX_SENT_TPD_TDIV_LEN (20u)

/** \brief Mask for Ifx_SENT_TPD_Bits.TDIV */
#define IFX_SENT_TPD_TDIV_MSK (0xfffffu)

/** \brief Offset for Ifx_SENT_TPD_Bits.TDIV */
#define IFX_SENT_TPD_TDIV_OFF (0u)

/** \brief Length for Ifx_SENT_RDR_Bits.RD0 */
#define IFX_SENT_RDR_RD0_LEN (4u)

/** \brief Mask for Ifx_SENT_RDR_Bits.RD0 */
#define IFX_SENT_RDR_RD0_MSK (0xfu)

/** \brief Offset for Ifx_SENT_RDR_Bits.RD0 */
#define IFX_SENT_RDR_RD0_OFF (0u)

/** \brief Length for Ifx_SENT_RDR_Bits.RD1 */
#define IFX_SENT_RDR_RD1_LEN (4u)

/** \brief Mask for Ifx_SENT_RDR_Bits.RD1 */
#define IFX_SENT_RDR_RD1_MSK (0xfu)

/** \brief Offset for Ifx_SENT_RDR_Bits.RD1 */
#define IFX_SENT_RDR_RD1_OFF (4u)

/** \brief Length for Ifx_SENT_RDR_Bits.RD2 */
#define IFX_SENT_RDR_RD2_LEN (4u)

/** \brief Mask for Ifx_SENT_RDR_Bits.RD2 */
#define IFX_SENT_RDR_RD2_MSK (0xfu)

/** \brief Offset for Ifx_SENT_RDR_Bits.RD2 */
#define IFX_SENT_RDR_RD2_OFF (8u)

/** \brief Length for Ifx_SENT_RDR_Bits.RD3 */
#define IFX_SENT_RDR_RD3_LEN (4u)

/** \brief Mask for Ifx_SENT_RDR_Bits.RD3 */
#define IFX_SENT_RDR_RD3_MSK (0xfu)

